IdeaRS.OpenModel.Connection.ConnectionInfo
Provides information about connection

IdeaRS.OpenModel.Connection.ConnectionInfo.Name
The name of the connection

IdeaRS.OpenModel.Connection.ConnectionInfo.Description
The description of the connection

IdeaRS.OpenModel.Connection.ConnectionInfo.Id
The id of the connection

IdeaRS.OpenModel.Connection.ConnectionInfo.Identifier
The identifier of the connection